//Задача 1. Дефинирайте константи PI, Е, и други с помощта на макроси.
//Използвайте ги в кода

#include <stdio.h>
#define PI 3.14
#define E 2.71

int main()
{
double res = PI + E;

printf("%lf", res);
}
